#Сборщик ошибок. Сборщик ошибок собирает ошибки каждый день в течение пяти дней. Напишите программу, которая ведет учет нарастающего итога ошибок,
#собранных в течение пяти дней. Цикл должен запрашивать количество ошибок, собираемых в течение каждого дня, и когда цикл завершается, программа
#должна вывести общее количество собранных ошибок.

total = 0.0
for days in range(5):
    errors = int(input(f'Введите количество ошибок за день {days}: '))
    total += errors
print(f'Количество ошибок за 5 дней составило {total:.0f} штук.')
