#Таблица соответствия между градусами Цельсия и градусами Фаренгейта. Напишите программу, которая выводит таблицу температур по шкале Цельсия от 0 до 20 и их
#эквиваленты по Фаренгейту. Формула преобразования температуры из шкалы Цельсия в шкалу Фаренгейта:
#F = 9/5 C + 32.
#где F — это температура по шкале Фаренгейта; C — температура по шкале Цельсия. Для вывода этой таблицы ваша программа должна применить цикл.

print('C\tF')
print('--------------')
maxc = 20
for c in range(maxc+1):
    f = 9 * c / 5 + 32
    print(c, f, sep = '\t')
    print()
