#Пройденное расстояние. Пройденное транспортным средством расстояние можно вычислить следующим образом:
#расстояние = скорость x время.
#Например, если поезд движется со скоростью 90 км/ч в течение трех часов, то пройденное расстояние составит 270 км. Напишите программу,
#которая запрашивает у пользователя скорость транспортного средства (в км/ч) и количество часов, которое оно двигалось.
#Затем она должна применить цикл для вывода расстояния, пройденного транспортным средством для каждого часа этого периода времени. 

speed = float(input('Какая скорость транспортного средства в км/ч? '))
time = int(input('Сколько часов оно двигалось? '))
print('Час\tПройденное расстояние')
print('--------------------------')
distance = 0
for t in range(time):
    distance = speed * (t+1)
    print(t+1, distance, sep='\t')
    print()
