#Персональные данные. Напишите программу, которая выводит приведенную ниже информацию:
#• ваше имя;
#• ваш адрес проживания, с городом, областью и почтовым индексом;
#• ваш номер телефона;
#• вашу специализацию в учебном заведении.
name = 'Роман'
address = '450071, Башкортостан Респ., г. Уфа'
tel_num = '+79612345678'
specialty = 'инженер-эколог'
print(f'Имя: {name}, ' +
	f'Адрес проживания: {address}, ' +
	f'Телефон: {tel_num}, ' +
	f'Специализация: {specialty}')
