#Пройденное расстояние. Допустим, что несчастные случаи или задержки отсутствуют, тогда расстояние, проезжаемое автомобилем по автостраде, можно вычислить на основе
#формулы: расстояние = скорость × время.
#Автомобиль движется со скоростью 70 км/ч. Напишите программу, которая показывает:
#• расстояние, которое автомобиль пройдет за 6 часов;
#• расстояние, которое автомобиль пройдет за 10 часов;
#• расстояние, которое автомобиль пройдет за 15 часов.
speed = 70
distance6 = speed * 6
distance10 = speed * 10
distance15 = speed * 15
print(f'За 6 часов автомобиль пройдет {distance6} км, за 10 часов – {distance10} км, за 15 часов – {distance15} км')
